There are -
1) read_csv()
2) read_json()       # But we use StringIO(json_data) before passing this to thios method
3) to_csv()          # Creates a new csv file
4) to_json()
5) read_html(url)    # install bs4 before this, this will return list of tables on that web page.
6) read_excel()
7) read_pickle()
8) to_pickle()

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('iris.csv')
df

   sepal_length  sepal_width  petal_length  petal_width     species
0           5.1          3.5           1.4          0.2      setosa
1           4.9          NaN           1.4          0.2      setosa
2           4.7          3.2           NaN          0.2      setosa
3           7.0          3.2           4.7          1.4  versicolor
4           6.4          3.2           4.5          1.5  versicolor
5           5.9          3.0           5.1          1.8   virginica
6          10.0          0.5           1.0          0.1      setosa
7           5.4          3.9           1.7          NaN      setosa
8           6.7          3.1           4.4        100.0  versicolor
9           5.1          3.5           1.4          0.2         NaN

In [4]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width     species
0           5.1          3.5           1.4          0.2      setosa
1           4.9          NaN           1.4          0.2      setosa
2           4.7          3.2           NaN          0.2      setosa
3           7.0          3.2           4.7          1.4  versicolor
4           6.4          3.2           4.5          1.5  versicolor

In [5]:
df.tail()

   sepal_length  sepal_width  petal_length  petal_width     species
5           5.9          3.0           5.1          1.8   virginica
6          10.0          0.5           1.0          0.1      setosa
7           5.4          3.9           1.7          NaN      setosa
8           6.7          3.1           4.4        100.0  versicolor
9           5.1          3.5           1.4          0.2         NaN

In [6]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      10.00000     9.000000      9.000000     9.000000
mean        6.12000     3.011111      2.844444    11.733333
std         1.57748     0.980363      1.755784    33.106986
min         4.70000     0.500000      1.000000     0.100000
25%         5.10000     3.100000      1.400000     0.200000
50%         5.65000     3.200000      1.700000     0.200000
75%         6.62500     3.500000      4.500000     1.500000
max        10.00000     3.900000      5.100000   100.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  10 non-null     float64
 1   sepal_width   9 non-null      float64
 2   petal_length  9 non-null      float64
 3   petal_width   9 non-null      float64
 4   species       9 non-null      object
dtypes: float64(4), object(1)
memory usage: 532.0+ bytes

In [8]:
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [9]:
df.isnull()

   sepal_length  sepal_width  petal_length  petal_width  species
0         False        False         False        False    False
1         False         True         False        False    False
2         False        False          True        False    False
3         False        False         False        False    False
4         False        False         False        False    False
5         False        False         False        False    False
6         False        False         False        False    False
7         False        False         False         True    False
8         False        False         False        False    False
9         False        False         False        False     True

In [10]:
# Handling Missing values....
df.isnull().any()

sepal_length    False
sepal_width      True
petal_length     True
petal_width      True
species          True
dtype: bool

In [11]:
df.isnull().sum()

sepal_length    0
sepal_width     1
petal_length    1
petal_width     1
species         1
dtype: int64

In [12]:
df_filled = df.fillna(0)
df_filled

   sepal_length  sepal_width  petal_length  petal_width     species
0           5.1          3.5           1.4          0.2      setosa
1           4.9          0.0           1.4          0.2      setosa
2           4.7          3.2           0.0          0.2      setosa
3           7.0          3.2           4.7          1.4  versicolor
4           6.4          3.2           4.5          1.5  versicolor
5           5.9          3.0           5.1          1.8   virginica
6          10.0          0.5           1.0          0.1      setosa
7           5.4          3.9           1.7          0.0      setosa
8           6.7          3.1           4.4        100.0  versicolor
9           5.1          3.5           1.4          0.2           0

In [13]:
df['sw_filled'] = df['sepal_width'].fillna(df['sepal_width'].median()).astype(int)
df

   sepal_length  sepal_width  petal_length  petal_width     species  sw_filled
0           5.1          3.5           1.4          0.2      setosa          3
1           4.9          NaN           1.4          0.2      setosa          3
2           4.7          3.2           NaN          0.2      setosa          3
3           7.0          3.2           4.7          1.4  versicolor          3
4           6.4          3.2           4.5          1.5  versicolor          3
5           5.9          3.0           5.1          1.8   virginica          3
6          10.0          0.5           1.0          0.1      setosa          0
7           5.4          3.9           1.7          NaN      setosa          3
8           6.7          3.1           4.4        100.0  versicolor          3
9           5.1          3.5           1.4          0.2         NaN          3

In [14]:
df = df.rename(columns = {'species': 'varieties'})

df.drop('sw_filled', inplace=True, axis=1)
df

   sepal_length  sepal_width  petal_length  petal_width   varieties
0           5.1          3.5           1.4          0.2      setosa
1           4.9          NaN           1.4          0.2      setosa
2           4.7          3.2           NaN          0.2      setosa
3           7.0          3.2           4.7          1.4  versicolor
4           6.4          3.2           4.5          1.5  versicolor
5           5.9          3.0           5.1          1.8   virginica
6          10.0          0.5           1.0          0.1      setosa
7           5.4          3.9           1.7          NaN      setosa
8           6.7          3.1           4.4        100.0  versicolor
9           5.1          3.5           1.4          0.2         NaN

In [15]:
# Aggregation
# SYNTAX: "df.groupby([column1, column2, ...])[target column (OPTIONAL)].agg([func1, func2, func3, ...])"

group = df.groupby('varieties').count()
group

grouped = df.groupby(['varieties'])['sepal_length'].agg(['mean', 'sum', 'count'])
grouped

            mean   sum  count
varieties
setosa      6.02  30.1      5
versicolor  6.70  20.1      3
virginica   5.90   5.9      1

In [27]:
# Merging

data1 = {
    'Name' : ['a', 'b', 'c'],
    'Age': [12, 13, 16]
}

data2 = {
    'Name' : ['a', 'b', 'd'],
    'Marks': [98, 97, 19]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1

  Name  Age
0    a   12
1    b   13
2    c   16

In [17]:
df2

  Name  Marks
0    a     98
1    b     97
2    d     19

In [18]:
merge = pd.merge(df1, df2, on = 'Name', how='inner')
merge

  Name  Age  Marks
0    a   12     98
1    b   13     97

In [19]:
merge = pd.merge(df1, df2, on = 'Name', how='left')
merge

  Name  Age  Marks
0    a   12   98.0
1    b   13   97.0
2    c   16    NaN

In [20]:
merge = pd.merge(df1, df2, on = 'Name', how='right')
merge

  Name   Age  Marks
0    a  12.0     98
1    b  13.0     97
2    d   NaN     19

In [21]:
merge = pd.merge(df1, df2, on = 'Name', how='outer')
merge

  Name   Age  Marks
0    a  12.0   98.0
1    b  13.0   97.0
2    c  16.0    NaN
3    d   NaN   19.0

In [39]:
# apply() method
s = pd.Series(['Alice', 'Bob', 'Charlie'])

s = s.apply(str.upper)
s

0      ALICE
1        BOB
2    CHARLIE
dtype: object

In [40]:

s = s.apply(lambda x : x[:3])
s

0    ALI
1    BOB
2    CHA
dtype: object